zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp253dxx_cm0.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief DMA Controller
  */
/* c7amba_dma3_v1_0 */
typedef struct
{
  __IO uint32_t SECCFGR;          /*!< DMA secure configuration register,                      Address offset: 0x00  */
  __IO uint32_t PRIVCFGR;         /*!< DMA privileged configuration register,                  Address offset: 0x04  */
  __IO uint32_t RCFGLOCKR;        /*!< DMA configuration lock register                         Address offset: 0x08 */
  __IO uint32_t MISR;             /*!< DMA non secure masked interrupt status register,        Address offset: 0x0C  */
  __IO uint32_t SMISR;            /*!< DMA secure masked interrupt status register,            Address offset: 0x10  */
       uint32_t RESERVED[1003];   /*!< Reserved                                                Address offset: 0x014-0xFBC */
  __IO uint32_t HWCFGR13;         /*!< HPDMA hardware configuration 13 register                Address offset: 0xFC0 */
  __IO uint32_t HWCFGR12;         /*!< HPDMA hardware configuration 12 register                Address offset: 0xFC4 */
  __IO uint32_t HWCFGR11;         /*!< HPDMA hardware configuration 11 register                Address offset: 0xFC8 */
  __IO uint32_t HWCFGR10;         /*!< HPDMA hardware configuration 10 register                Address offset: 0xFCC */
  __IO uint32_t HWCFGR9;          /*!< HPDMA hardware configuration 9 register                 Address offset: 0xFD0 */
  __IO uint32_t HWCFGR8;          /*!< HPDMA hardware configuration 8 register                 Address offset: 0xFD4 */
  __IO uint32_t HWCFGR7;          /*!< HPDMA hardware configuration 7 register                 Address offset: 0xFD8 */
  __IO uint32_t HWCFGR6;          /*!< HPDMA hardware configuration 6 register                 Address offset: 0xFDC */
  __IO uint32_t HWCFGR5;          /*!< HPDMA hardware configuration 5 register                 Address offset: 0xFE0 */
  __IO uint32_t HWCFGR4;          /*!< HPDMA hardware configuration 4 register                 Address offset: 0xFE4 */
  __IO uint32_t HWCFGR3;          /*!< HPDMA hardware configuration 3 register                 Address offset: 0xFE8 */
  __IO uint32_t HWCFGR2;          /*!< HPDMA hardware configuration 2 register                 Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;          /*!< HPDMA hardware configuration 1 register                 Address offset: 0xFF0 */
  __IO uint32_t VERR;             /*!< HPDMA version register                                  Address offset: 0xFF4 */
  __IO uint32_t IPIDR;            /*!< HPDMA identification register                           Address offset: 0xFF8 */
  __IO uint32_t SIDR;             /*!< HPDMA size identification register                      Address offset: 0xFFC */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CLBAR;        /*!< DMA channel x linked-list base address register, Address offset: 0x50 + (x * 0x80) */
  __IO uint32_t CCIDCFGR;     /*!< DMA channel x CID register,                      Address offset: 0x54 + (x * 0x80) */
  __IO uint32_t CSEMCR;       /*!< DMA channel x semaphore control register,        Address offset: 0x58 + (x * 0x80) */
  __IO uint32_t CFCR;         /*!< DMA channel x flag clear register,               Address offset: 0x5C + (x * 0x80) */
  __IO uint32_t CSR;          /*!< DMA channel x flag status register,              Address offset: 0x60 + (x * 0x80) */
  __IO uint32_t CCR;          /*!< DMA channel x control register,                  Address offset: 0x64 + (x * 0x80) */
       uint32_t RESERVED2[10];/*!< Reserved 2,                                      Address offset: 0x68 -- 0x8C      */
  __IO uint32_t CTR1;         /*!< DMA channel x transfer register 1,               Address offset: 0x90 + (x * 0x80) */
  __IO uint32_t CTR2;         /*!< DMA channel x transfer register 2,               Address offset: 0x94 + (x * 0x80) */
  __IO uint32_t CBR1;         /*!< DMA channel x block register 1,                  Address offset: 0x98 + (x * 0x80) */
  __IO uint32_t CSAR;         /*!< DMA channel x source address register,           Address offset: 0x9C + (x * 0x80) */
  __IO uint32_t CDAR;         /*!< DMA channel x destination address register,      Address offset: 0xA0 + (x * 0x80) */
  __IO uint32_t CTR3;         /*!< DMA channel x transfer register 3,               Address offset: 0xA4 + (x * 0x80) */
  __IO uint32_t CBR2;         /*!< DMA channel x block register 2,                  Address offset: 0xA8 + (x * 0x80) */
       uint32_t RESERVED3[8]; /*!< Reserved 3,                                      Address offset: 0xAC -- 0xC8      */
  __IO uint32_t CLLR;         /*!< DMA channel x linked-list address register,      Address offset: 0xCC + (x * 0x80) */
} DMA_Channel_TypeDef;

/*
 * @brief EXTI Block description (EXTI)
 * c7amba_exti_v3-0_UserSpec_v3_0_0m *
 */
typedef struct
{
  __IO uint32_t RTSR1;           /*!< EXTI rising trigger selection register        Address offset: 0x000 */
  __IO uint32_t FTSR1;           /*!< EXTI falling trigger selection register       Address offset: 0x004 */
  __IO uint32_t SWIER1;          /*!< EXTI software interrupt event register        Address offset: 0x008 */
  __IO uint32_t RPR1;            /*!< EXTI rising edge pending register             Address offset: 0x00C */
  __IO uint32_t FPR1;            /*!< EXTI falling edge pending register            Address offset: 0x010 */
  __IO uint32_t SECCFGR1;        /*!< EXTI security configuration register          Address offset: 0x014 */
  __IO uint32_t PRIVCFGR1;       /*!< EXTI Privilege configuration register         Address offset: 0x018 */
       uint32_t RESERVED0;       /*!< Reserved                                      Address offset: 0x01C */
  __IO uint32_t RTSR2;           /*!< EXTI rising trigger selection register        Address offset: 0x020 */
  __IO uint32_t FTSR2;           /*!< EXTI falling trigger selection register       Address offset: 0x024 */
  __IO uint32_t SWIER2;          /*!< EXTI software interrupt event register        Address offset: 0x028 */
  __IO uint32_t RPR2;            /*!< EXTI rising edge pending register             Address offset: 0x02C */
  __IO uint32_t FPR2;            /*!< EXTI falling edge pending register            Address offset: 0x030 */
  __IO uint32_t SECCFGR2;        /*!< EXTI security enable register                 Address offset: 0x034 */
  __IO uint32_t PRIVCFGR2;       /*!< EXTI Privilege enable register                Address offset: 0x038 */
       uint32_t RESERVED1;       /*!< Reserved                                       Address offset: 0x03C */
  __IO uint32_t RTSR3;           /*!< EXTI rising trigger selection register        Address offset: 0x040 */
  __IO uint32_t FTSR3;           /*!< EXTI falling trigger selection register       Address offset: 0x044 */
  __IO uint32_t SWIER3;          /*!< EXTI software interrupt event register        Address offset: 0x048 */
  __IO uint32_t RPR3;            /*!< EXTI rising edge pending register             Address offset: 0x04C */
  __IO uint32_t FPR3;            /*!< EXTI falling edge pending register            Address offset: 0x050 */
  __IO uint32_t SECCFGR3;        /*!< EXTI security enable register                 Address offset: 0x054 */
  __IO uint32_t PRIVCFGR3;       /*!< EXTI Privilege enable register                Address offset: 0x058 */
       uint32_t RESERVED15;      /*!< Reserved                                       Address offset: 0x05C */
  __IO uint32_t EXTICR[4];       /*!< EXTI external interrupt selection register 1  Address offset: 0x060-0x6C */
  __IO uint32_t LOCKR;           /*!< EXTI lock register                            Address offset: 0x070 */
       uint32_t RESERVED3[3];    /*!< Reserved                                       Address offset: 0x074-0x07C */
  __IO uint32_t C1IMR1;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x080 */
       uint32_t RESERVED17[3];   /*!< Reserved                                       Address offset: 0x088-0x08C */
  __IO uint32_t C1IMR2;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x090 */
       uint32_t RESERVED18[3];   /*!< Reserved                                       Address offset: 0x098-0x09C */
  __IO uint32_t C1IMR3;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x0A0 */
       uint32_t RESERVED6[7];    /*!< Reserved                                       Address offset: 0x0A8-0x0BC */
  __IO uint32_t C2IMR1;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0C0 */
  __IO uint32_t C2EMR1;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0C4 */
       uint32_t RESERVED20[2];   /*!< Reserved                                       Address offset: 0x0C8-0x0CC */
  __IO uint32_t C2IMR2;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0D0 */
  __IO uint32_t C2EMR2;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0D4 */
       uint32_t RESERVED21[2];   /*!< Reserved                                       Address offset: 0x0D8-0x0DC */
  __IO uint32_t C2IMR3;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0E0 */
  __IO uint32_t C2EMR3;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0E4 */
         uint32_t RESERVED22[6];   /*!< Reserved                                       Address offset: 0x0E8-0x0FC */
  __IO uint32_t C3IMR1;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x100 */
  __IO uint32_t C3EMR1;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x104 */
       uint32_t RESERVED23[2];   /*!< Reserved                                       Address offset: 0x108-0x10C */
  __IO uint32_t C3IMR2;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x110 */
  __IO uint32_t C3EMR2;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x114 */
       uint32_t RESERVED24[2];   /*!< Reserved                                       Address offset: 0x118-0x11C */
  __IO uint32_t C3IMR3;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x120 */
       uint32_t RESERVED25[23];  /*!< Reserved                                       Address offset: 0x124-0x17C */
  __IO uint32_t ECIDCFGR[96];    /*!< EXTI configurable event CID Config register   Address offset: 0x180-0x2BC */
  __IO uint32_t C1CIDCFGR;       /*!< EXTI processor 1 CID configuration register   Address offset: 0x300 */
  __IO uint32_t C2CIDCFGR;       /*!< EXTI processor 2 CID configuration register   Address offset: 0x304 */
  __IO uint32_t C3CIDCFGR;       /*!< EXTI processor 3 CID configuration register   Address offset: 0x308 */
       uint32_t RESERVED27[45];  /*!< Reserved                                      Address offset: 0x30C-0x3BC */
  __IO uint32_t HWCFGR13;        /*!< EXTI Hardware configuration register 13       Address offset: 0x3C0 */
  __IO uint32_t HWCFGR12;        /*!< EXTI Hardware configuration register 12       Address offset: 0x3C4 */
  __IO uint32_t HWCFGR11;        /*!< EXTI Hardware configuration register 11       Address offset: 0x3C8 */
       uint32_t RESERVED12[3];   /*!< Reserved                                      Address offset: 0x3CC-0x3D4 */
  __IO uint32_t HWCFGR7;         /*!< EXTI Hardware configuration register 7        Address offset: 0x3D8 */
  __IO uint32_t HWCFGR6;         /*!< EXTI Hardware configuration register 6        Address offset: 0x3DC */
  __IO uint32_t HWCFGR5;         /*!< EXTI Hardware configuration register 5        Address offset: 0x3E0 */
  __IO uint32_t HWCFGR4;         /*!< EXTI Hardware configuration register 4        Address offset: 0x3E4 */
  __IO uint32_t HWCFGR3;         /*!< EXTI Hardware configuration register 3        Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< EXTI Hardware configuration register 2        Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< EXTI Hardware configuration register 1        Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< EXTI IP Version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< EXTI Identification register                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< EXTI Size ID register                         Address offset: 0x3FC */
} EXTI_TypeDef;

typedef struct
{
  __IO uint32_t IMR1;                /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
  __IO uint32_t EMR1;                /*!< EXTI Event mask register,                    Address offset: 0x04 */
  uint32_t      RESERVED1[2];        /*!< Reserved, offset 0x08 -> 0x10                                     */
  __IO uint32_t IMR2;                /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
  __IO uint32_t EMR2;                /*!< EXTI Event mask register,                    Address offset: 0x14 */
  uint32_t      RESERVED2[2];        /*!< Reserved, offset 0x18 -> 0x20                                     */
  __IO uint32_t IMR3;                /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
  __IO uint32_t EMR3;                /*!< EXTI Event mask register,                    Address offset: 0x24 */
  uint32_t      RESERVED3[6];        /*!< Reserved, offset 0x28 -> 0x40                                     */
} EXTI_Core_TypeDef;

/**
* @brief General Purpose I/O
* @note c7amba_ioport4 Rev 1.0.2
*/
typedef struct
{
  __IO uint32_t MODER;           /*!< GPIO mode register                                  Address offset: 0x000 */
  __IO uint32_t OTYPER;          /*!< GPIO output type register                           Address offset: 0x004 */
  __IO uint32_t OSPEEDR;         /*!< GPIO output speed register                          Address offset: 0x008 */
  __IO uint32_t PUPDR;           /*!< GPIO port pull-up/pull-down register                Address offset: 0x00C */
  __IO uint32_t IDR;             /*!< GPIO input data register                            Address offset: 0x010 */
  __IO uint32_t ODR;             /*!< GPIO output data register                           Address offset: 0x014 */
  __IO uint32_t BSRR;            /*!< GPIO bit set/reset register                         Address offset: 0x018 */
  __IO uint32_t LCKR;            /*!< GPIO configuration lock register                    Address offset: 0x01C */
  __IO uint32_t AFR[2];          /*!< GPIO alternate function  registers                  Address offset: 0x020 */
  __IO uint32_t BRR;             /*!< GPIO bit reset register                             Address offset: 0x028 */
  __IO uint32_t OR;              /*!< GPIO bit option register                            Address offset: 0x02C */
  __IO uint32_t SECCFGR;         /*!< GPIO secure configuration register                  Address offset: 0x030 */
  __IO uint32_t PRIVCFGR;        /*!< GPIO privileged configuration register              Address offset: 0x034 */
  __IO uint32_t RCFGLOCKR;       /*!< GPIO resource configuration lock register           Address offset: 0x038 */
       uint32_t RESERVED0;       /*!< Reserved                                            Address offset: 0x03C */
  __IO uint32_t DELAYRL;         /*!< GPIO delay low register                             Address offset: 0x040 */
  __IO uint32_t DELAYRH;         /*!< GPIO delay high register                            Address offset: 0x044 */
  __IO uint32_t ADVCFGRL;        /*!< GPIO PIO control low register                       Address offset: 0x048 */
  __IO uint32_t ADVCFGRH;        /*!< GPIO delay high register                            Address offset: 0x04C */

  __IO uint32_t CIDCFGR0;        /*!< GPIO CID configuration register for I/O pin 0       Address offset: 0x050 */
  __IO uint32_t SEMCR0;          /*!< GPIO semaphore control register for I/O pin 0       Address offset: 0x054 */
  __IO uint32_t CIDCFGR1;        /*!< GPIO CID configuration register for I/O pin 1       Address offset: 0x058 */
  __IO uint32_t SEMCR1;          /*!< GPIO semaphore control register for I/O pin 1       Address offset: 0x05C */
  __IO uint32_t CIDCFGR2;        /*!< GPIO CID configuration register for I/O pin 2       Address offset: 0x060 */
  __IO uint32_t SEMCR2;          /*!< GPIO semaphore control register for I/O pin 2       Address offset: 0x064 */
  __IO uint32_t CIDCFGR3;        /*!< GPIO CID configuration register for I/O pin 3       Address offset: 0x068 */
  __IO uint32_t SEMCR3;          /*!< GPIO semaphore control register for I/O pin 3       Address offset: 0x06C */
  __IO uint32_t CIDCFGR4;        /*!< GPIO CID configuration register for I/O pin 4       Address offset: 0x070 */
  __IO uint32_t SEMCR4;          /*!< GPIO semaphore control register for I/O pin 4       Address offset: 0x074 */
  __IO uint32_t CIDCFGR5;        /*!< GPIO CID configuration register for I/O pin 5       Address offset: 0x078 */
  __IO uint32_t SEMCR5;          /*!< GPIO semaphore control register for I/O pin 5       Address offset: 0x07C */
  __IO uint32_t CIDCFGR6;        /*!< GPIO CID configuration register for I/O pin 6       Address offset: 0x080 */
  __IO uint32_t SEMCR6;          /*!< GPIO semaphore control register for I/O pin 6       Address offset: 0x084 */
  __IO uint32_t CIDCFGR7;        /*!< GPIO CID configuration register for I/O pin 7       Address offset: 0x088 */
  __IO uint32_t SEMCR7;          /*!< GPIO semaphore control register for I/O pin 7       Address offset: 0x08C */
  __IO uint32_t CIDCFGR8;        /*!< GPIO CID configuration register for I/O pin 8       Address offset: 0x090 */
  __IO uint32_t SEMCR8;          /*!< GPIO semaphore control register for I/O pin 8       Address offset: 0x094 */
  __IO uint32_t CIDCFGR9;        /*!< GPIO CID configuration register for I/O pin 9       Address offset: 0x098 */
  __IO uint32_t SEMCR9;          /*!< GPIO semaphore control register for I/O pin 9       Address offset: 0x09C */
  __IO uint32_t CIDCFGR10;       /*!< GPIO CID configuration register for I/O pin 10      Address offset: 0x0A0 */
  __IO uint32_t SEMCR10;         /*!< GPIO semaphore control register for I/O pin 10      Address offset: 0x0A4 */
  __IO uint32_t CIDCFGR11;       /*!< GPIO CID configuration register for I/O pin 11      Address offset: 0x0A8 */
  __IO uint32_t SEMCR11;         /*!< GPIO semaphore control register for I/O pin 11      Address offset: 0x0AC */
  __IO uint32_t CIDCFGR12;       /*!< GPIO CID configuration register for I/O pin 12      Address offset: 0x0B0 */
  __IO uint32_t SEMCR12;         /*!< GPIO semaphore control register for I/O pin 12      Address offset: 0x0B4 */
  __IO uint32_t CIDCFGR13;       /*!< GPIO CID configuration register for I/O pin 13      Address offset: 0x0B8 */
  __IO uint32_t SEMCR13;         /*!< GPIO semaphore control register for I/O pin 13      Address offset: 0x0BC */
  __IO uint32_t CIDCFGR14;       /*!< GPIO CID configuration register for I/O pin 14      Address offset: 0x0C0 */
  __IO uint32_t SEMCR14;         /*!< GPIO semaphore control register for I/O pin 14      Address offset: 0x0C4 */
  __IO uint32_t CIDCFGR15;       /*!< GPIO CID configuration register for I/O pin 15      Address offset: 0x0C8 */
  __IO uint32_t SEMCR15;         /*!< GPIO semaphore control register for I/O pin 15      Address offset: 0x0CC */
       uint32_t RESERVED1[190];  /*!< Reserved                                            Address offset: 0x0D0-0x3C4 */
  __IO uint32_t HWCFGR10;        /*!< GPIO hardware configuration register 10             Address offset: 0x3C8 */
  __IO uint32_t HWCFGR9;         /*!< GPIO hardware configuration register 9              Address offset: 0x3CC */
  __IO uint32_t HWCFGR8;         /*!< GPIO hardware configuration register 8              Address offset: 0x3D0 */
  __IO uint32_t HWCFGR7;         /*!< GPIO hardware configuration register 7              Address offset: 0x3D4 */
  __IO uint32_t HWCFGR6;         /*!< GPIO hardware configuration register 6              Address offset: 0x3D8 */
  __IO uint32_t HWCFGR5;         /*!< GPIO hardware configuration register 5              Address offset: 0x3DC */
  __IO uint32_t HWCFGR4;         /*!< GPIO hardware configuration register 4              Address offset: 0x3E0 */
  __IO uint32_t HWCFGR3;         /*!< GPIO hardware configuration register 3              Address offset: 0x3E4 */
  __IO uint32_t HWCFGR2;         /*!< GPIO hardware configuration register 2              Address offset: 0x3E8 */
  __IO uint32_t HWCFGR1;         /*!< GPIO hardware configuration register 1              Address offset: 0x3EC */
  __IO uint32_t HWCFGR0;         /*!< GPIO hardware configuration register 0              Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< GPIO version register                               Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< GPIO identification register                        Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< GPIO size identification register                   Address offset: 0x3FC */
} GPIO_TypeDef;

